CoreMaker-lab/STM32H503CB_LIS2DUX12/STM32H503CB_LIS2DUX12_Project2/Core/Inc/lis2dux12_reg.h
#define LIS2DUX12_MLC3_SRC                             0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc3_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc3_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_mlc3_src_t;

#define LIS2DUX12_MLC4_SRC                             0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc4_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc4_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_mlc4_src_t;

#define LIS2DUX12_FSM_ODR                              0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t fsm_odr                      : 3;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t fsm_odr                      : 3;
  uint8_t not_used0                    : 3;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_fsm_odr_t;

#define LIS2DUX12_MLC_ODR                              0x3AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t mlc_odr                      : 3;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t mlc_odr                      : 3;
  uint8_t not_used0                    : 4;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_mlc_odr_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page pg0_emb_adv
  * @{
  *
  */
#define LIS2DUX12_EMB_ADV_PG_0                         0x000U

#define LIS2DUX12_FSM_LC_TIMEOUT_L                     0x54U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_fsm_lc_timeout_l_t;

#define LIS2DUX12_FSM_LC_TIMEOUT_H                     0x55U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_lc_timeout               : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_fsm_lc_timeout_h_t;

#define LIS2DUX12_FSM_PROGRAMS                         0x56U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_n_prog                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_n_prog                   : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_fsm_programs_t;

#define LIS2DUX12_FSM_START_ADD_L                      0x58U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_start                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_start                    : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_fsm_start_add_l_t;

#define LIS2DUX12_FSM_START_ADD_H                      0x59U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_start                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_start                    : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_fsm_start_add_h_t;

#define LIS2DUX12_PEDO_CMD_REG                         0x5DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t fp_rejection_en              : 1;
  uint8_t carry_count_en               : 1;
  uint8_t not_used1                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 4;
  uint8_t carry_count_en               : 1;
  uint8_t fp_rejection_en              : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_pedo_cmd_reg_t;

#define LIS2DUX12_PEDO_DEB_STEPS_CONF                  0x5EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t deb_step                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t deb_step                     : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_pedo_deb_steps_conf_t;

#define LIS2DUX12_PEDO_SC_DELTAT_L                     0xAAU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                        : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_pedo_sc_deltat_l_t;

#define LIS2DUX12_PEDO_SC_DELTAT_H                     0xABU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                        : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_pedo_sc_deltat_h_t;

#define LIS2DUX12_T_SENSITIVITY_L                      0xB6U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t t_s                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t t_s                          : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_t_sensitivity_l_t;

#define LIS2DUX12_T_SENSITIVITY_H                      0xB7U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t t_s                          : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t t_s                          : 8;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_t_sensitivity_h_t;

#define LIS2DUX12_SMART_POWER_CTRL                     0xD2U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t smart_power_ctrl_win         : 4;
  uint8_t smart_power_ctrl_dur         : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t smart_power_ctrl_dur         : 4;
  uint8_t smart_power_ctrl_win         : 4;
#endif /* DRV_BYTE_ORDER */
} lis2dux12_smart_power_ctrl_t;

/**
  * @}
  *
  */

typedef union
{
  lis2dux12_pin_ctrl_t    pin_ctrl;
  lis2dux12_wake_up_dur_ext_t    wake_up_dur_ext;
  lis2dux12_who_am_i_t    who_am_i;
  lis2dux12_ctrl1_t    ctrl1;
  lis2dux12_ctrl2_t    ctrl2;
  lis2dux12_ctrl3_t    ctrl3;
  lis2dux12_ctrl4_t    ctrl4;
  lis2dux12_ctrl5_t    ctrl5;
  lis2dux12_fifo_ctrl_t    fifo_ctrl;
  lis2dux12_fifo_wtm_t    fifo_wtm;
  lis2dux12_interrupt_cfg_t    interrupt_cfg;
  lis2dux12_sixd_t    sixd;
  lis2dux12_wake_up_ths_t    wake_up_ths;
  lis2dux12_wake_up_dur_t    wake_up_dur;
  lis2dux12_free_fall_t    free_fall;
  lis2dux12_md1_cfg_t    md1_cfg;
  lis2dux12_md2_cfg_t    md2_cfg;
  lis2dux12_wake_up_src_t    wake_up_src;
  lis2dux12_tap_src_t    tap_src;
  lis2dux12_sixd_src_t    sixd_src;
  lis2dux12_all_int_src_t    all_int_src;
  lis2dux12_status_register_t    status;
  lis2dux12_fifo_status1_t    fifo_status1;
  lis2dux12_fifo_status2_t    fifo_status2;
  lis2dux12_out_x_l_t    out_x_l;
  lis2dux12_out_x_h_t    out_x_h;
  lis2dux12_out_y_l_t    out_y_l;
  lis2dux12_out_y_h_t    out_y_h;
  lis2dux12_out_z_l_t    out_z_l;
  lis2dux12_out_z_h_t    out_z_h;
  lis2dux12_out_t_l_t    out_t_l;
  lis2dux12_out_t_h_t    out_t_h;
  lis2dux12_self_test_t    self_test;
  lis2dux12_i3c_if_ctrl_t    i3c_if_ctrl;
  lis2dux12_emb_func_status_mainpage_t    emb_func_status_mainpage;
  lis2dux12_fsm_status_mainpage_t    fsm_status_mainpage;
  lis2dux12_mlc_status_mainpage_t    mlc_status_mainpage;
  lis2dux12_sleep_t    sleep;
  lis2dux12_en_device_config_t    en_device_config;
  lis2dux12_func_cfg_access_t    func_cfg_access;
  lis2dux12_fifo_data_out_tag_t    fifo_data_out_tag;
  lis2dux12_fifo_data_out_x_l_t    fifo_data_out_x_l;
  lis2dux12_fifo_data_out_x_h_t    fifo_data_out_x_h;
  lis2dux12_fifo_data_out_y_l_t    fifo_data_out_y_l;
  lis2dux12_fifo_data_out_y_h_t    fifo_data_out_y_h;
  lis2dux12_fifo_data_out_z_l_t    fifo_data_out_z_l;
  lis2dux12_fifo_data_out_z_h_t    fifo_data_out_z_h;
  lis2dux12_fifo_batch_dec_t    fifo_batch_dec;
  lis2dux12_tap_cfg0_t    tap_cfg0;
  lis2dux12_tap_cfg1_t    tap_cfg1;
  lis2dux12_tap_cfg2_t    tap_cfg2;
  lis2dux12_tap_cfg3_t    tap_cfg3;
  lis2dux12_tap_cfg4_t    tap_cfg4;
  lis2dux12_tap_cfg5_t    tap_cfg5;
  lis2dux12_tap_cfg6_t    tap_cfg6;
  lis2dux12_timestamp0_t    timestamp0;
  lis2dux12_timestamp1_t    timestamp1;
  lis2dux12_timestamp2_t    timestamp2;
  lis2dux12_timestamp3_t    timestamp3;
  lis2dux12_page_sel_t    page_sel;
  lis2dux12_emb_func_en_a_t    emb_func_en_a;
  lis2dux12_emb_func_en_b_t    emb_func_en_b;
  lis2dux12_emb_func_exec_status_t    emb_func_exec_status;
  lis2dux12_page_address_t    page_address;
  lis2dux12_page_value_t    page_value;
  lis2dux12_emb_func_int1_t    emb_func_int1;
  lis2dux12_fsm_int1_t    fsm_int1;
  lis2dux12_mlc_int1_t    mlc_int1;
  lis2dux12_emb_func_int2_t    emb_func_int2;
  lis2dux12_fsm_int2_t    fsm_int2;
  lis2dux12_mlc_int2_t    mlc_int2;
  lis2dux12_emb_func_status_t    emb_func_status;
  lis2dux12_fsm_status_t    fsm_status;
  lis2dux12_mlc_status_t    mlc_status;
  lis2dux12_page_rw_t    page_rw;
  lis2dux12_emb_func_fifo_en_t    emb_func_fifo_en;
  lis2dux12_fsm_enable_t    fsm_enable;
  lis2dux12_fsm_long_counter_l_t    fsm_long_counter_l;
  lis2dux12_fsm_long_counter_h_t    fsm_long_counter_h;
  lis2dux12_int_ack_mask_t    int_ack_mask;
  lis2dux12_fsm_outs1_t    fsm_outs1;
  lis2dux12_fsm_outs2_t    fsm_outs2;
  lis2dux12_fsm_outs3_t    fsm_outs3;
  lis2dux12_fsm_outs4_t    fsm_outs4;
  lis2dux12_fsm_outs5_t    fsm_outs5;
  lis2dux12_fsm_outs6_t    fsm_outs6;
  lis2dux12_fsm_outs7_t    fsm_outs7;
  lis2dux12_fsm_outs8_t    fsm_outs8;
  lis2dux12_step_counter_l_t    step_counter_l;
  lis2dux12_step_counter_h_t    step_counter_h;
  lis2dux12_emb_func_src_t    emb_func_src;
  lis2dux12_emb_func_init_a_t    emb_func_init_a;
  lis2dux12_emb_func_init_b_t    emb_func_init_b;
  lis2dux12_mlc1_src_t    mlc1_src;
  lis2dux12_mlc2_src_t    mlc2_src;
  lis2dux12_mlc3_src_t    mlc3_src;
  lis2dux12_mlc4_src_t    mlc4_src;
  lis2dux12_fsm_odr_t    fsm_odr;
  lis2dux12_mlc_odr_t    mlc_odr;
  lis2dux12_fsm_lc_timeout_l_t    fsm_lc_timeout_l;
  lis2dux12_fsm_lc_timeout_h_t    fsm_lc_timeout_h;
  lis2dux12_fsm_programs_t    fsm_programs;
  lis2dux12_fsm_start_add_l_t    fsm_start_add_l;
  lis2dux12_fsm_start_add_h_t    fsm_start_add_h;
  lis2dux12_pedo_cmd_reg_t    pedo_cmd_reg;
  lis2dux12_pedo_deb_steps_conf_t    pedo_deb_steps_conf;
  lis2dux12_pedo_sc_deltat_l_t    pedo_sc_deltat_l;
  lis2dux12_pedo_sc_deltat_h_t    pedo_sc_deltat_h;
  lis2dux12_t_sensitivity_l_t    t_sensitivity_l;
  lis2dux12_t_sensitivity_h_t    t_sensitivity_h;
  lis2dux12_smart_power_ctrl_t   smart_power_ctrl;
  bitwise_t    bitwise;
  uint8_t    byte;
} lis2dux12_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

