CoreMaker-lab/STM32H503CB_LIS2DUX12/STM32H503CB_LIS2DUX12_Project2/Core/Inc/lis2dux12_reg.h
typedef enum
{
  LIS2DUX12_BYPASS_MODE              = 0x0,
  LIS2DUX12_FIFO_MODE                = 0x1,
  LIS2DUX12_STREAM_TO_FIFO_MODE      = 0x3,
  LIS2DUX12_BYPASS_TO_STREAM_MODE    = 0x4,
  LIS2DUX12_STREAM_MODE              = 0x6,
  LIS2DUX12_BYPASS_TO_FIFO_MODE      = 0x7,
  LIS2DUX12_FIFO_OFF                 = 0x8,
} lis2dux12_operation_t;

typedef enum
{
  LIS2DUX12_FIFO_1X                  = 0,
  LIS2DUX12_FIFO_2X                  = 1,
} lis2dux12_store_t;

typedef enum
{
  LIS2DUX12_DEC_TS_OFF             = 0x0,
  LIS2DUX12_DEC_TS_1               = 0x1,
  LIS2DUX12_DEC_TS_8               = 0x2,
  LIS2DUX12_DEC_TS_32              = 0x3,
} lis2dux12_dec_ts_t;

typedef enum
{
  LIS2DUX12_BDR_XL_ODR             = 0x0,
  LIS2DUX12_BDR_XL_ODR_DIV_2       = 0x1,
  LIS2DUX12_BDR_XL_ODR_DIV_4       = 0x2,
  LIS2DUX12_BDR_XL_ODR_DIV_8       = 0x3,
  LIS2DUX12_BDR_XL_ODR_DIV_16      = 0x4,
  LIS2DUX12_BDR_XL_ODR_DIV_32      = 0x5,
  LIS2DUX12_BDR_XL_ODR_DIV_64      = 0x6,
  LIS2DUX12_BDR_XL_ODR_OFF         = 0x7,
} lis2dux12_bdr_xl_t;

typedef enum
{
  LIS2DUX12_FIFO_EV_WTM           = 0x0,
  LIS2DUX12_FIFO_EV_FULL          = 0x1,
} lis2dux12_fifo_event_t;

typedef struct
{
  lis2dux12_operation_t operation;
  lis2dux12_store_t store;
  uint8_t xl_only                      : 1; /* only XL samples (16-bit) are stored in FIFO */
  uint8_t cfg_change_in_fifo           : 1;
} lis2dux12_fifo_mode_t;
int32_t lis2dux12_fifo_mode_set(const stmdev_ctx_t *ctx, lis2dux12_fifo_mode_t val);
int32_t lis2dux12_fifo_mode_get(const stmdev_ctx_t *ctx, lis2dux12_fifo_mode_t *val);

int32_t lis2dux12_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  lis2dux12_dec_ts_t dec_ts; /* decimation for timestamp batching*/
  lis2dux12_bdr_xl_t bdr_xl; /* accelerometer batch data rate*/
} lis2dux12_fifo_batch_t;

int32_t lis2dux12_fifo_batch_set(const stmdev_ctx_t *ctx, lis2dux12_fifo_batch_t val);
int32_t lis2dux12_fifo_batch_get(const stmdev_ctx_t *ctx, lis2dux12_fifo_batch_t *val);

int32_t lis2dux12_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, lis2dux12_fifo_event_t val);
int32_t lis2dux12_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx, lis2dux12_fifo_event_t *val);

int32_t lis2dux12_fifo_data_level_get(const stmdev_ctx_t *ctx, uint16_t *val);
int32_t lis2dux12_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2DUX12_FIFO_EMPTY                 = 0x0,
  LIS2DUX12_XL_TEMP_TAG                = 0x2,
  LIS2DUX12_XL_ONLY_2X_TAG             = 0x3,
  LIS2DUX12_TIMESTAMP_TAG              = 0x4,
  LIS2DUX12_STEP_COUNTER_TAG           = 0x12,
  LIS2DUX12_MLC_RESULT_TAG             = 0x1A,
  LIS2DUX12_MLC_FILTER_TAG             = 0x1B,
  LIS2DUX12_MLC_FEATURE                = 0x1C,
  LIS2DUX12_FSM_RESULT_TAG             = 0x1D,
} lis2dux12_fifo_sensor_tag_t;
int32_t lis2dux12_fifo_sensor_tag_get(const stmdev_ctx_t *ctx,
                                      lis2dux12_fifo_sensor_tag_t *val);

int32_t lis2dux12_fifo_out_raw_get(const stmdev_ctx_t *ctx, uint8_t *buff);

typedef struct
{
  uint8_t tag;
  struct
  {
    float_t mg[3];
    int16_t raw[3];
  } xl[2];
  struct
  {
    float_t deg_c;
    int16_t raw;
  } heat;
  struct
  {
    uint32_t steps;
    uint32_t timestamp;
  } pedo;
  struct
  {
    uint8_t cfg_change                 : 1; /* 1 if ODR/BDR configuration is changed */
    uint8_t odr                        : 4; /* ODR */
    uint8_t bw                         : 2; /* BW */
    uint8_t lp_hp                      : 1; /* Power: 0 for LP, 1 for HP */
    uint8_t fs                         : 2; /* FS */
    uint8_t dec_ts                     : 2; /* Timestamp decimator value */
    uint8_t odr_xl_batch               : 1; /* Accelerometer ODR is batched */
    uint32_t timestamp;
  } cfg_chg;
} lis2dux12_fifo_data_t;
int32_t lis2dux12_fifo_data_get(const stmdev_ctx_t *ctx, const lis2dux12_md_t *md,
                                const lis2dux12_fifo_mode_t *fmd,
                                lis2dux12_fifo_data_t *data);

typedef struct
{
  uint8_t false_step_rej               : 1;
  uint8_t step_counter_enable          : 1;
  uint8_t step_counter_in_fifo         : 1;
} lis2dux12_stpcnt_mode_t;
int32_t lis2dux12_stpcnt_mode_set(const stmdev_ctx_t *ctx, lis2dux12_stpcnt_mode_t val);
int32_t lis2dux12_stpcnt_mode_get(const stmdev_ctx_t *ctx, lis2dux12_stpcnt_mode_t *val);

int32_t lis2dux12_stpcnt_steps_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lis2dux12_stpcnt_rst_step_set(const stmdev_ctx_t *ctx);

int32_t lis2dux12_stpcnt_debounce_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_stpcnt_debounce_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dux12_stpcnt_period_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lis2dux12_stpcnt_period_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef struct
{
  uint8_t enable                       : 1;
  uint8_t window                       : 1;
  uint8_t duration                     : 1;
} lis2dux12_smart_power_cfg_t;
int32_t lis2dux12_smart_power_set(const stmdev_ctx_t *ctx, lis2dux12_smart_power_cfg_t val);
int32_t lis2dux12_smart_power_get(const stmdev_ctx_t *ctx, lis2dux12_smart_power_cfg_t *val);

int32_t lis2dux12_tilt_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_tilt_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);
int32_t lis2dux12_sigmot_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_sigmot_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);


int32_t lis2dux12_ff_duration_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_ff_duration_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2DUX12_156_mg = 0x0,
  LIS2DUX12_219_mg = 0x1,
  LIS2DUX12_250_mg = 0x2,
  LIS2DUX12_312_mg = 0x3,
  LIS2DUX12_344_mg = 0x4,
  LIS2DUX12_406_mg = 0x5,
  LIS2DUX12_469_mg = 0x6,
  LIS2DUX12_500_mg = 0x7,
} lis2dux12_ff_thresholds_t;
int32_t lis2dux12_ff_thresholds_set(const stmdev_ctx_t *ctx, lis2dux12_ff_thresholds_t val);
int32_t lis2dux12_ff_thresholds_get(const stmdev_ctx_t *ctx, lis2dux12_ff_thresholds_t *val);

