CoreMaker-lab/STM32H503CB_LIS2DUX12/STM32H503CB_LIS2DUX12_Project2/Core/Inc/lis2dux12_reg.h
typedef enum
{
  LIS2DUX12_DEG_80 = 0x0,
  LIS2DUX12_DEG_70 = 0x1,
  LIS2DUX12_DEG_60 = 0x2,
  LIS2DUX12_DEG_50 = 0x3,
} lis2dux12_threshold_t;

typedef enum
{
  LIS2DUX12_6D = 0x0,
  LIS2DUX12_4D = 0x1,
} lis2dux12_mode_t;

typedef struct
{
  lis2dux12_threshold_t threshold;
  lis2dux12_mode_t mode;
} lis2dux12_sixd_config_t;

int32_t lis2dux12_sixd_config_set(const stmdev_ctx_t *ctx, lis2dux12_sixd_config_t val);
int32_t lis2dux12_sixd_config_get(const stmdev_ctx_t *ctx, lis2dux12_sixd_config_t *val);

typedef enum
{
  LIS2DUX12_0_ODR  = 0x000, /* 0 ODR time */
  LIS2DUX12_1_ODR  = 0x001, /* 1 ODR time */
  LIS2DUX12_2_ODR  = 0x002, /* 2 ODR time */
  LIS2DUX12_3_ODR  = 0x100, /* 3 ODR time */
  LIS2DUX12_7_ODR  = 0x101, /* 7 ODR time */
  LIS2DUX12_11_ODR = 0x102, /* 11 ODR time */
  LIS2DUX12_15_ODR = 0x103, /* 15 ODR time */
} lis2dux12_wake_dur_t;

typedef enum
{
  LIS2DUX12_SLEEP_OFF = 0,
  LIS2DUX12_SLEEP_ON  = 1,
} lis2dux12_wake_enable_t;

typedef enum
{
  LIS2DUX12_ODR_NO_CHANGE       = 0x0,  /* no odr change during inactivity state */
  LIS2DUX12_ODR_1_6_HZ          = 0x1,  /* set odr to 1.6Hz during inactivity state */
  LIS2DUX12_ODR_3_HZ            = 0x2,  /* set odr to 3Hz during inactivity state */
  LIS2DUX12_ODR_25_HZ           = 0x3,  /* set odr to 25Hz during inactivity state */
} lis2dux12_inact_odr_t;

typedef struct
{
  lis2dux12_wake_dur_t wake_dur;
  uint8_t sleep_dur                    : 4;       /* 1 LSB == 512 ODR time */
  uint8_t wake_ths                     : 7;       /* wakeup threshold */
  uint8_t wake_ths_weight              : 1;       /* 0: 1LSB = FS_XL/2^6, 1: 1LSB = FS_XL/2^8 */
  lis2dux12_wake_enable_t wake_enable;
  lis2dux12_inact_odr_t inact_odr;
} lis2dux12_wakeup_config_t;

int32_t lis2dux12_wakeup_config_set(const stmdev_ctx_t *ctx, lis2dux12_wakeup_config_t val);
int32_t lis2dux12_wakeup_config_get(const stmdev_ctx_t *ctx, lis2dux12_wakeup_config_t *val);

typedef enum
{
  LIS2DUX12_TAP_NONE  = 0x0, /* No axis */
  LIS2DUX12_TAP_ON_X  = 0x1, /* Detect tap on X axis */
  LIS2DUX12_TAP_ON_Y  = 0x2, /* Detect tap on Y axis */
  LIS2DUX12_TAP_ON_Z  = 0x3, /* Detect tap on Z axis */
} lis2dux12_axis_t;

typedef struct
{
  lis2dux12_axis_t axis;
  uint8_t inverted_peak_time           : 5; /* 1 LSB == 1 sample */
  uint8_t pre_still_ths                : 4; /* 1 LSB == 62.5 mg */
  uint8_t post_still_ths               : 4; /* 1 LSB == 62.5 mg */
  uint8_t post_still_time              : 6; /* samples num during stationary condition */
  uint8_t shock_wait_time              : 6; /* samples num during shock condition */
  uint8_t latency                      : 4; /* samples max num between taps */
  uint8_t wait_end_latency             : 1; /* wait end of latency time to generate tap events */
  uint8_t peak_ths                     : 6; /* 1 LSB == 62.5 mg */
  uint8_t rebound                      : 5; /* samples num during rebound condition */
  uint8_t pre_still_start              : 4; /* pre still start */
  uint8_t pre_still_n                  : 4; /* pre still n */
  uint8_t single_tap_on                : 1; /* enable single tap */
  uint8_t double_tap_on                : 1; /* enable double tap */
  uint8_t triple_tap_on                : 1; /* enable triple tap */
} lis2dux12_tap_config_t;

int32_t lis2dux12_tap_config_set(const stmdev_ctx_t *ctx, lis2dux12_tap_config_t val);
int32_t lis2dux12_tap_config_get(const stmdev_ctx_t *ctx, lis2dux12_tap_config_t *val);

int32_t lis2dux12_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dux12_timestamp_raw_get(const stmdev_ctx_t *ctx, uint32_t *val);

int32_t lis2dux12_long_cnt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                               uint8_t *val);

int32_t lis2dux12_emb_fsm_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_emb_fsm_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  lis2dux12_fsm_enable_t          fsm_enable;
} lis2dux12_emb_fsm_enable_t;
int32_t lis2dux12_fsm_enable_set(const stmdev_ctx_t *ctx,
                                 lis2dux12_emb_fsm_enable_t *val);
int32_t lis2dux12_fsm_enable_get(const stmdev_ctx_t *ctx,
                                 lis2dux12_emb_fsm_enable_t *val);

int32_t lis2dux12_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lis2dux12_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t lis2dux12_fsm_status_get(const stmdev_ctx_t *ctx,
                                 lis2dux12_fsm_status_mainpage_t *val);
int32_t lis2dux12_fsm_out_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2DUX12_ODR_FSM_12Hz5 = 0,
  LIS2DUX12_ODR_FSM_25Hz  = 1,
  LIS2DUX12_ODR_FSM_50Hz  = 2,
  LIS2DUX12_ODR_FSM_100Hz = 3,
  LIS2DUX12_ODR_FSM_200Hz = 4,
  LIS2DUX12_ODR_FSM_400Hz = 5,
  LIS2DUX12_ODR_FSM_800Hz = 6,
} lis2dux12_fsm_val_odr_t;
int32_t lis2dux12_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                    lis2dux12_fsm_val_odr_t val);
int32_t lis2dux12_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                    lis2dux12_fsm_val_odr_t *val);

int32_t lis2dux12_fsm_init_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_fsm_init_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dux12_fsm_fifo_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_fsm_fifo_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dux12_long_cnt_int_value_set(const stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t lis2dux12_long_cnt_int_value_get(const stmdev_ctx_t *ctx,
                                         uint16_t *val);

int32_t lis2dux12_fsm_programs_num_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_fsm_programs_num_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dux12_fsm_start_address_set(const stmdev_ctx_t *ctx,
                                        uint16_t val);
int32_t lis2dux12_fsm_start_address_get(const stmdev_ctx_t *ctx,
                                        uint16_t *val);

typedef enum
{
  LIS2DUX12_MLC_OFF                    = 0,
  LIS2DUX12_MLC_ON                     = 1,
  LIS2DUX12_MLC_ON_BEFORE_FSM          = 2,
} lis2dux12_mlc_mode_t;
int32_t lis2dux12_mlc_set(const stmdev_ctx_t *ctx, lis2dux12_mlc_mode_t val);
int32_t lis2dux12_mlc_get(const stmdev_ctx_t *ctx, lis2dux12_mlc_mode_t *val);

int32_t lis2dux12_mlc_status_get(const stmdev_ctx_t *ctx,
                                 lis2dux12_mlc_status_mainpage_t *val);

int32_t lis2dux12_mlc_out_get(const stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum
{
  LIS2DUX12_ODR_PRGS_12Hz5 = 0,
  LIS2DUX12_ODR_PRGS_25Hz  = 1,
  LIS2DUX12_ODR_PRGS_50Hz  = 2,
  LIS2DUX12_ODR_PRGS_100Hz = 3,
  LIS2DUX12_ODR_PRGS_200Hz = 4,
} lis2dux12_mlc_odr_val_t;
int32_t lis2dux12_mlc_data_rate_set(const stmdev_ctx_t *ctx,
                                    lis2dux12_mlc_odr_val_t val);
int32_t lis2dux12_mlc_data_rate_get(const stmdev_ctx_t *ctx,
                                    lis2dux12_mlc_odr_val_t *val);

int32_t lis2dux12_mlc_fifo_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dux12_mlc_fifo_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

#ifdef __cplusplus
}
#endif

#endif /* LIS2DUX12_REGS_H */